import os
os.system('clear')
print("----------------------------")
print('----------- Start ----------')
print('----------------------------',end='\n'*3)

p='123'
passw=input('Ведіть пароль:')
if passw==p:
    print('Пароли правильний')
    allow=input('Дати доступ до даниху/n: ')
    if allow=="y":
        print('\n',"\U0001f44d \U0001F923")
elif passw=='0':
    print('Ви увійшли як гість')
elif passw=='1':
    print('Ви увійшли як користувач')
else:
    print('В доступі мідмовлено')
print('\n'*3,'------------------------------')
print('------------ End -------------')